[
  {
    "section": "Register",
    "title": "Register new account",
    "description": "This page will take you through the process of creating a new account.",
    "fields": [
      {
        "title": null,
        "image": "src/main/resources/images/register.png",
        "text": "To start the registering process click the \"Register button\". This is found at the bottom-middle of the start page. This will take you to a new page."
      },
      {
        "title": null,
        "image": null,
        "text": "On this page there are three input fields in the middle of the page. One for  a \"Username\", a \"Password\" and a field for \"Repeat password\". There are also two checkboxes below the fields. The checkboxes are for \"No password\" and \"Remember me\". With the \"No password\"-box checked the only field needed for a registration is the \"Username\" field, else a password must also be made. The \"Remember me\" checkbox, if checked, allows a user to be instantly logged in to their account after it has been made."
      },
      {
        "title": null,
        "image": null,
        "text": "When the necessary fields have been filled the next step is to press the \"Register\"-button. This button is located below the checkboxes and at the bottom of the box. When pressed the account will be created and you will be taken to the \"Dashboard\"-page."
      }
    ]
  },
  {
    "section": "Login",
    "title": "Login to a account",
    "description": "This page will take you through the process of logging into a account",
    "fields": [
      {
        "title": "Login to an existing account",
        "image": null,
        "text": "To login to an existing account you first have to press the \"Login\"-button. This button is located to the right side of the account you want to login to. A registered account will be in a white field, with the username on the left and the \"Login\"-button on the right. When pressed one of two things can happen."
      },
      {
        "title": "Account with a Password",
        "image": null,
        "text": "If the user created a password for their account you will be taken to a new page. On this page there will be a field with the username of the user and an empty \"Password\"-field. You must input the correct password for the user in the \"Password\"-field before you can login to the account. This is done by pressing the \"Login\"-button located at the bottom-center of the box. After this is done you will be taken to the \"Dashboard\"-page for this account."
      },
      {
        "title": null,
        "image": null,
        "text": "The \"Login with password\"-page also has a \"Remember me\"-checkbox. When checked and you have logged in to the account, the program will automatically log you in to this account the next time you start the program. There is also an arrow pointing to the left at the top left corner of the box. This arrow, when clicked, will take you back to the \"Users overview\"-page. For information about the button on the bottom-center of the page, see \"Register\" help-page."
      },
      {
        "title": "Account without a Password",
        "image": null,
        "text": "If the user does not have a password for their account, then you will be automatically logged in to that account. This will transport you to that user's own \"Dashboard\"-page."
      }
    ]
  },
  {
    "section": "Dashboard",
    "title": "The dashboard page and its content",
    "description": "This page gives info about the dashboard page and its content",
    "fields": [
      {
        "title": "How to access",
        "image": null,
        "text": "The main page and default page for the application. From this page you can access the rest of the application. To access this page from another page in the application simply click the \"Dashboard\"-button located at the top of the application within the navigation bar."
      },
      {
        "title": "The sidebar to the left",
        "image": null,
        "text": "If you look to the left side of the page you can see a sidebar containing your categories and the premade categories \"All tasks\", \"Trash bin\" and \"Finished tasks\". There will also be two buttons on this bar: \"+ New Category\" and \"+ New project\". For more information about these see \"Category\" help-page."
      },
      {
        "title": "The navigation bar at the top",
        "image": null,
        "text": "For information about the navigation bar at the top of the application see the \"Navigation bar at the top\" help-page."
      }
    ]
  },
  {
    "section": "Overview",
    "title": "Overview",
    "description": "This page gives information about the overview page and its contents",
    "fields": [
      {
        "title": "How to access",
        "image": null,
        "text": "This page can be accessed by clicking the \"Overview\"-button located at the top of the application in the navigation bar."
      },
      {
        "title": "Content and simple view",
        "image": null,
        "text": "On this page you can see two buttons. The are located in the upper left corner right below the application logo. These buttons are \"Simple view\" and \"Calendar view\"."
      },
      {
        "title": null,
        "image": null,
        "text": "The page you are currently on is the \"Simple view\" page, since this is the default overview page. Here you can see three containers with the text: \"Tasks due this week\", \"Tasks due the next 7 days\" and \"Tasks due this month\"."
      },
      {
        "title": null,
        "image": null,
        "text": "These containers will contain tasks with a deadline within the given time. Thus all not finished or deleted tasks which are due in the next 7 days will be in under the container \"Tasks due the next 7 days\". Similarly tasks which are due this month will be under \"Tasks due this month\" and the same for tasks under \"Tasks due this week\"."
      },
      {
        "title": "Calendar view",
        "image": null,
        "text": "By clicking on the \"Calendar view\"-button you will be sent to the \"Calendar view\" page. On this page all tasks will be under their deadline. Thus if the deadline of a task is on the 15th day of this month then it will be visible under the 15th day. This page will also allow you to check future dates and task-deadlines. For instance you can check what tasks you have for the next month or next year."
      },
      {
        "title": null,
        "image": null,
        "text": "This is done by pressing the circle with the arrow button pointing to the right. This button is located in the upper-center of the \"Calendar view\" page. To the left of this button the currently viewed month and year is written. To the left of this again, a similar button with an arrow pointing to the left is located. By pressing this button you will be able to watch past months and years."
      }
    ]
  },
  {
    "section": "Account",
    "title": "Account",
    "description": "This page gives information about the account page and what it contains",
    "fields": [
      {
        "title": "How to access",
        "image": null,
        "text": "This page can be accessed by clicking the \"Account\"-button located at the top of the application in the navigation bar."
      },
      {
        "title": "On the page",
        "image": null,
        "text": "On this page you have a few options. First are the four colored fields: \"Username\", \"Date account created\", \"Task count\" and \"Category count\". These fields represent, in order: the username of the account, the date the account was made, the amount of tasks created on this account and the amount of categories made on this account."
      },
      {
        "title": "Changing the color theme",
        "image": null,
        "text": "Below the statistics fields there will be multiple colored buttons. These buttons are called themes. On them there is a color written, representing the color of the button. By clicking a button you will change the color theme of the application to the color of the button."
      },
      {
        "title": "Custom background",
        "image": null,
        "text": "Right below the themes buttons there is another button with the text \"+ Background\" written on it. By clicking on it a new \"file explorer\"-window will be opened. Here you can choose a picture on your computer. A miniature version of the picture will be added to the right of the button, just below the theme-buttons. By clicking on the picture you choose, the background of the application will change to that picture. If you wish to revert the change just click on the small picture with \"None\" written in it. It will be to the right of the \"+ Background\"-button and to the left of any custom backgrounds you have chosen."
      },
      {
        "title": "Edit account",
        "image": null,
        "text": "Lastly at the bottom-center of the page there is a button with the text \"Edit account\" written on it. By clicking it you will be transported to the \"Edit account\"-page."
      },
      {
        "title": null,
        "image": null,
        "text": "On this page are three input fields. The first field is for the account username. The second and third fields are for changing the password or making a brand new password for the account."
      },
      {
        "title": null,
        "image": null,
        "text": "Below these fields there is a \"No password\"-checkbox. When checked this account will no longer need a password before login. The current password will also be deleted."
      },
      {
        "title": null,
        "image": null,
        "text": "Below this checkbox there is a button with the text \"Edit account\" written on it. When pressed the changes made on this page will be saved."
      },
      {
        "title": null,
        "image": null,
        "text": "Lastly at the bottom-center of the page, there is a \"Cancel\"-button. By pressing this button all unsaved changes will be deleted and you will be returned back to the \"Account\"-page."
      }
    ]
  },
  {
    "section": "New / Edit task",
    "title": "New / Edit task",
    "description": "This page gives info about how to create and edit a task, as well as the contents of a task",
    "fields": [
      {
        "title": "Creat a new task",
        "image": null,
        "text": "Create a new task by clicking the \"Task\" button. This button is located at the center-boarder of the category you are currently in."
      },
      {
        "title": null,
        "image": null,
        "text": "This opens the \"New task\" page. Here you can select either advanced or simple format by pressing ether. They are both located to the right of the center at the top of this page. By clicking on either word the page will change to that format. The default in \"New task\" is the simple format."
      },
      {
        "title": null,
        "image": null,
        "text": "The task title is the first field. It can max be x characters long. This is the only field that is required to create a task."
      },
      {
        "title": null,
        "image": null,
        "text": "Below the task title field there is a due date field and due time field. These can either be blank or a time can be set. To set the due date you either click on the calendar icon to the left of the field, or click on the field and write the date yourself. If you click on the calendar icon simply click on the desired due date and it will be set. To set the due time you either click on the clock icon to the left of the field, or click on the field and write the time yourself. If you click on the clock simply click on the desired due time yourself and it will be set."
      },
      {
        "title": null,
        "image": null,
        "text": "Below the due time and due date fields there are three checkboxes. These checkboxes are for reminders of the task. When checked they will send a notification about the task when the due date is within the checked time. Thus if the deadline of a task is within the next 24 hours and the 24 hours box is checked, you will receive a notification about the task. Multiple boxes can be checked for a single task."
      },
      {
        "title": null,
        "image": null,
        "text": "At the bottom-center of the \"New task\" page there are two buttons. They are the \"+ New task\"-button and \"Cancel\"-button. When clicked the \"+ New task\"-button will create a new task with the information you provided. The \"Cancel\"-button will send you back to the category you were previously in, as well as deleting the task you were creating."
      },
      {
        "title": "Edit a task",
        "image": null,
        "text": "A task can be edited by clicking on the pencil shaped button. This button is located in the upper right corner of the task."
      },
      {
        "title": null,
        "image": null,
        "text": "This opens the \"Edit task\" page. Here you can select either advanced or simple format by pressing ether. They are both located to the right of the center at the top of this page. By clicking on either word the page will change to that format. The default in \"Edit task\" is the advanced format."
      },
      {
        "title": null,
        "image": null,
        "text": "The task title is the first field at the top of the page. It can max be x characters long. This is the only field that is required to edit a task."
      },
      {
        "title": "Content (Optional)",
        "image": null,
        "text": ""
      },
      {
        "title": "Description",
        "image": null,
        "text": "Below the task title there is a \"Description\" field. Here you may fill in additional details about a task. This is normally used for an in depth description of the task."
      },
      {
        "title": "Location",
        "image": null,
        "text": "Below the \"Description\" field there is a \"Location\" field. Here you may write where the task is supposed to take place. For example if the task takes place in the garden, you can write \"The garden\" in the \"Location\" field."
      },
      {
        "title": "Priority",
        "image": null,
        "text": "Below the \"Location\" field there is a \"Priority\" menu. This menu is meant for choosing the priority of the task. By clicking on the menu four options will appear. Click on one to change the priority of the task. The options range from lowest (Top) to highest (bottom) priority."
      },
      {
        "title": "Repeat task",
        "image": null,
        "text": "Below the \"Priority\" menu there is a \"Repeat task\" menu. The default for this one is \"None\". By clicking on the menu a total of three options will appear. Click on one to set the repeat interval for the task. The options are \"None\", \"Repeat Daily\" and \"Repeat Weekly\". These intervals represent how often this task will be repeated."
      },
      {
        "title": null,
        "image": null,
        "text": "By choosing \"Repeat Daily\" the task will continue to be made each day. That means that each new day after the deadline of this task, a new instance of this task will be made with a new deadline. \"Repeat Weekly\" does the same thing, with a week as the interval. Meaning that in a month between four and five instances of this task will be made. \"None\" simply means that the task will repeat no additional times"
      },
      {
        "title": null,
        "image": null,
        "text": "To get rid of a repeating task, you will first have to manually go into the \"Edit task\" page and change the \"Repeat task\" menu to \"None\"."
      },
      {
        "title": "Due date and time",
        "image": null,
        "text": "Below the \"Repeat task\" menu there is a \"Due date\" field and \"Due time\" field. These can either be blank or a time can be set."
      },
      {
        "title": null,
        "image": null,
        "text": "To set the due date you either click on the calendar icon to the left of the field, or click on the field and write the date yourself. If you click on the calendar icon simply click on the desired due date and it will be set."
      },
      {
        "title": null,
        "image": null,
        "text": "To set the due time you either click on the clock icon to the left of the field, or click on the field and write the time yourself. If you click on the clock simply click on the desired due time yourself and it will be set."
      },
      {
        "title": "Task color",
        "image": null,
        "text": "Below the \"Due date\" and \"Due time\" fields there is a \"Task color\" button. This button lets you change the color of the task when pressed."
      },
      {
        "title": null,
        "image": null,
        "text": "It will show a set of default colors that you can click on. If you want a custom color click the \"custom color\" button."
      },
      {
        "title": null,
        "image": null,
        "text": "This will take you to a menu that opens a color picker and lets you insert color in the formats RGB, HSB and HEX."
      },
      {
        "title": "Tags",
        "image": null,
        "text": "Below \"Task color\" there is a large field about the same size as the \"Description\" field. This field is known as the \"Tags\" field. Tags are normally used to have small search terms on your task. This is helpful if you got a lot of tasks in the same category. To create a tag simply click the \"Tags\" field and start typing. When you have written the tag simply press enter and it will be made."
      },
      {
        "title": "Attach files",
        "image": null,
        "text": "Just below the \"Tags\" field there is another button. This button is known as the \"Attach files\" button and the field next to it is where attached files will be displayed. To attach a file, just click this button and a file explorer will appear. Choose the file you want and it will appear in the field to the right. All chosen files in the field can be clicked. If enough files are attached to the task you will have to scroll in the field to the file you want to click."
      },
      {
        "title": null,
        "image": null,
        "text": "By clicking on a file, a new popup will appear. Here you have three options. Two buttons at the bottom of the popup and a X-shaped button in the top right corner. The two buttons are the \"Open file\" button and the \"Remove file\" button. Click the \"Open file\" button to open the file and click the \"Remove file\" button to remove the file from the task. The X-shaped button will close the popup. The popup will also close if you click any other place on the page than the popup."
      },
      {
        "title": "Notifications",
        "image": null,
        "text": "Just above the bottom of the page there are three checkboxes. These checkboxes are for reminders of the task. When checked they will send a notification about the task when the due date is within the checked time. Thus if the deadline of a task is within the next 24 hours and the 24 hours box is checked, you will receive a notification about the task. Multiple boxes can be checked for a single task."
      },
      {
        "title": "Bottom buttons",
        "image": null,
        "text": "At the bottom-center of the \"Edit task\" page there are two buttons. They are the \"+ Edit task\"-button and \"Cancel\"-button. When clicked the \"+ Edit task\"-button will overwrite the current task with the information you provided. The \"Cancel\"-button will send you back to the category you were previously in, as well as deleting all unsaved changes you made in the \"Edit task\" page."
      }
    ]
  },
  {
    "section": "Navigation bar at the top",
    "title": "Navigation bar at the top",
    "description": "This page gives info about the navigation bar at the top of the application",
    "fields": [
      {
        "title": null,
        "image": null,
        "text": "The navigation bar at the top of the application allows for quick access to the main pages of the program. This bar is populated with our logo in the top left corner and 6 buttons to the right of this logo. These six buttons are: \"Dashboard\", \"Overview\", \"Account\", \"Help\", \"Log out\" and a bell-shaped button."
      },
      {
        "title": null,
        "image": null,
        "text": "By clicking on one of the buttons you will be sent to the corresponding page. For example if you click on the \"Account\"-button you will be sent to the \"Account\" page. For the \"Log out\"-button you will be logged out."
      },
      {
        "title": "Notifications button",
        "image": null,
        "text": "Additionally the bell-shaped button is known as the \"Notification\"-button and will display your notifications. These notifications are displayed in a circle with a number in it, resting to the left about the bell. The number represents the amount of unchecked notifications."
      },
      {
        "title": null,
        "image": null,
        "text": "If you click on the bell a new popup will appear. This popup contains all your notifications and a button at the top which reads \"Notification History\". To remove a notification press the V-shaped button in the top right corner of the notification you wish to remove. If you press the \"Notification History\"-button you will be sent to the \"Notification History\" page."
      }
    ]
  },
  {
    "section": "Category",
    "title": "Category",
    "description": "This page gives info about how to create, add and delete a category",
    "fields": [
      {
        "title": null,
        "image": null,
        "text": "You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. "
      },
      {
        "title": null,
        "image": null,
        "text": ""
      }
    ]
  }
]