[
  {
    "section": "Register",
    "title": "Register new account",
    "description": "This page will take you through the process of creating a new account.",
    "fields": [
      {
        "title": null,
        "image": "src/main/resources/images/register.png",
        "text": "To start the registering process click the \"Register button\". This is found at the bottom-middle of the start page. This will take you to a new page."
      },
      {
        "title": null,
        "image": null,
        "text": "On this page there are three input fields in the middle of the page. One for  a \"Username\", a \"Password\" and a field for \"Repeat password\". There are also two checkboxes below the fields. The checkboxes are for \"No password\" and \"Remember me\". With the \"No password\"-box checked the only field needed for a registration is the \"Username\" field, else a password must also be made. The \"Remember me\" checkbox, if checked, allows a user to be instantly logged in to their account after it has been made."
      },
      {
        "title": null,
        "image": null,
        "text": "When the necessary fields have been filled the next step is to press the \"Register\"-button. This button is located below the checkboxes and at the bottom of the blue box. When pressed the account will be created and you will be taken to the \"Dashboard\"-page."
      }
    ]
  },
  {
    "section": "Login",
    "title": "Login to a account",
    "description": "This page will take you through the process of logging into a account",
    "fields": [
      {
        "title": "Login to an existing account",
        "image": null,
        "text": "To login to an existing account you first have to press the \"Login\"-button. This button is located to the right side of the account you want to login to. A registered account will be in a white field, with the username on the left and the \"Login\"-button on the right. When pressed one of two things can happen."
      },
      {
        "title": "Account with a Password",
        "image": null,
        "text": "If the user created a password for their account you will be taken to a new page. On this page there will be a field with the username of the user and an empty \"Password\"-field. You must input the correct password for the user in the \"Password\"-field before you can login to the account. This is done by pressing the \"Login\"-button located at the bottom-center of the blue box. After this is done you will be taken to the \"Dashboard\"-page for this account."
      },
      {
        "title": null,
        "image": null,
        "text": "The \"Login with password\"-page also has a \"Remember me\"-checkbox. When checked and you have logged in to the account, the program will automatically log you in to this account the next time you start the program. There is also an arrow pointing to the left at the top left corner of the blue box. This arrow, when clicked, will take you back to the \"Users overview\"-page. For information about the button on the bottom-center of the page, see \"Register\" help-page."
      },
      {
        "title": "Account without a Password",
        "image": null,
        "text": "If the user does not have a password for their account, then you will be automatically logged in to that account. This will transport you to that user's own \"Dashboard\"-page."
      }
    ]
  },
  {
    "section": "Dashboard",
    "title": "The dashboard page and its content",
    "description": "This page gives info about the dashboard page and its content",
    "fields": [
      {
        "title": null,
        "image": null,
        "text": "The main page and default page for the application. From this page you can access the rest of the application."
      },
      {
        "title": "The blue sidebar to the left",
        "image": null,
        "text": "If you look to the left side of the page you can see a blue sidebar containing your categories and the premade categories \"All tasks\", \"Trash bin\" and \"Finished tasks\". There will also be two buttons on this bar: \"+ New Category\" and \"+ New project\". For more information about these see \"Category\" help-page."
      },
      {
        "title": "The blue navigation bar at the top",
        "image": null,
        "text": "For information about the blue navigation bar at the top of the application see the \"Navigation bar at the top\" help-page."
      }
    ]
  },
  {
    "section": "Account",
    "title": "Account",
    "description": "This page gives information about the account page and what it contains",
    "fields": [
      {
        "title": null,
        "image": null,
        "text": ""
      }
    ]
  },
  {
    "section": "Category",
    "title": "Category",
    "description": "This page gives info about how to create, add and delete a category",
    "fields": [
      {
        "title": null,
        "image": null,
        "text": "You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. You fucking suck dude. "
      },
      {
        "title": null,
        "image": null,
        "text": ""
      }
    ]
  }
]